docs/gate/mutations/02-theta-truncation-half.patch
diff --git a/core/src/theta.cpp b/core/src/theta.cpp
index 313eaa2..8eb0617 100644
--- a/core/src/theta.cpp
+++ b/core/src/theta.cpp
@@ -107,7 +107,7 @@ Ball theta_certified(double t, mpfr_prec_t prec) {
   // carries <= c_k * 2^(1-p); dominant term is c_1/t.
   const double coeff_slack = std::ldexp(1.0, static_cast<int>(1 - prec))
                              * ((1.0 / 48.0) / t) * (1.0 + 1e-3);
-  double radius = kThetaSafety * rem_base + mpfr_slack + coeff_slack;
+  double radius = 0.5 * kThetaSafety * rem_base + mpfr_slack + coeff_slack;
   // Compile-time gated falsifiability hook; an inline 1.0 in production
   // builds (zetaforge/sabotage.hpp). Never reads the environment here.
   radius *= zf_radius_sabotage_scale();
