docs/gate/mutations/02-theta-truncation-half.patch
diff --git a/core/src/theta.cpp b/core/src/theta.cpp
index 0afe2cd..7f6a03f 100644
--- a/core/src/theta.cpp
+++ b/core/src/theta.cpp
@@ -374,7 +374,7 @@ Ball theta_certified(double t, mpfr_prec_t prec) {
   const int sc = ce > 2100 ? 2100 : static_cast<int>(ce);
   const double coeff_slack =
       inflate(std::ldexp(((1.0 / 48.0) / t) * (1.0 + 1e-3), -sc));
-  double radius = rem_proven + mpfr_slack + coeff_slack;
+  double radius = 0.5 * rem_proven + mpfr_slack + coeff_slack;
   // Compile-time gated falsifiability hook; an inline 1.0 in production
   // builds (zetaforge/sabotage.hpp). Never reads the environment here.
   radius *= zf_radius_sabotage_scale();
