docs/gate/mutations/06-cball-mul-radius-0.25.patch
diff --git a/core/include/zetaforge/cball.hpp b/core/include/zetaforge/cball.hpp
index da578e4..4bc1944 100644
--- a/core/include/zetaforge/cball.hpp
+++ b/core/include/zetaforge/cball.hpp
@@ -224,8 +224,8 @@ struct CBall {
 
     mpfr_swap(re, nre);
     mpfr_swap(im, nim);
-    rr = inflate(dre);
-    ri = inflate(dim);
+    rr = inflate(dre * 0.25);
+    ri = inflate(dim * 0.25);
 
     mpfr_clear(t1);
     mpfr_clear(t2);
