docs/gate/mutations/12-golden-digit-flipped.patch
diff --git a/docs/golden/theta_golden.csv b/docs/golden/theta_golden.csv
index 25ab767..a63096e 100644
--- a/docs/golden/theta_golden.csv
+++ b/docs/golden/theta_golden.csv
@@ -3,7 +3,7 @@ t,value
 200,245.651435098988972824686569844488925822310057834871643788162482487624002984199403855244758696803822030889227578202653083149669277000177930839323568814633015375222238649
 250,335.05536568332500605731524358503944285994397161495467040025612160972188922251541023469056523699687793524716215534179632219516590825937038369520450224055705735583778099016
 315,458.67191971147158879684712750135970632544096415483150343340189177362529212955935207818815960754684521990654012199535373081587954258121330374844220055814913983048971791363
-500,843.79010058818922951540337601132056328864818897122082984095877608042153490904272974337532095444148152081873990097174201879882786698009982136932038428821255122527953654792
+500,843.39010058818922951540337601132056328864818897122082984095877608042153490904272974337532095444148152081873990097174201879882786698009982136932038428821255122527953654792
 800,1538.3011914634030411932496510329175595338121885391735423064563916844047102736110977611866691621407289321917217170429459690621874242976473730482770261229272059389741633233
 1290,2788.9229950285827863810859167369624051799143117118101424054624179974677322905932959296069749570337600109559817587993336240536249515582470545358194149359872246928630532905
 2000,4762.6327044677049723321400844371690529384469116513767652553347982724663627399620924894839571943320235906520339020144636276276537132976547220399952905011901147603654048812
