docs/gate/mutations/14-ffix-mul-wrap.patch
diff --git a/core/include/zetaforge/ffix.hpp b/core/include/zetaforge/ffix.hpp
index c13fcc8..e965998 100644
--- a/core/include/zetaforge/ffix.hpp
+++ b/core/include/zetaforge/ffix.hpp
@@ -105,9 +105,6 @@ class Ffix {
     // the shift exact (top < 2^63 gives top<<64 < 2^127), after which the
     // assembled range test below is itself exact. mid < 2^121 and low >> 64 <
     // 2^64 under the same operand contract, so the sum cannot wrap either.
-    if (!(top < (u128)1 << 63)) {
-      throw std::overflow_error("ffix mul overflow");
-    }
     u128 res = top << 64;
     res += mid;
     res += static_cast<u128>(low >> 64);
