docs/gate/mutations/23-subt0-golden-digit.patch
diff --git a/docs/golden/theta_golden_subt0.csv b/docs/golden/theta_golden_subt0.csv
index 8e94cb5..602aaf1 100644
--- a/docs/golden/theta_golden_subt0.csv
+++ b/docs/golden/theta_golden_subt0.csv
@@ -6,7 +6,7 @@ t,value
 0.01,-0.026858223408248269541894315830396416749979634705775365966121246470551167916150478156042875454949680408935187572505866356699842454690547734795788045811832788120934012170585
 0.1,-0.2659770913495793942033325816111824833599275278689134265640080453074938738732627574481148147167031080819441065169837144840299460174943455669883425060015293979824787792379
 0.5,-1.1250527154055628615759010850710874547615777403947532738271184489493502056348986992192871231721310755430282341006054397067774385469539574210276474971727970033757439737912
-1.0,-1.7675479528122903883022164992643870423194838631437863292542879841734090308655146331192773923466578174862875649711231141625723535062627441333459227345127224899003820069729
+1.0,-1.7775479528122903883022164992643870423194838631437863292542879841734090308655146331192773923466578174862875649711231141625723535062627441333459227345127224899003820069729
 2.0,-2.5259109188161326900128727264053650836355909453731758303439245446444242170091036173225032094052113408019094357972374050030742618045893861428646868588253728223755169276915
 3.0,-2.9945646960108252362404545356607462806063088020909434498472184994958070344160040576136009958612753717218772569948747101408219577202206742199508277472862353141489833403331
 5.0,-3.4596203753634625331854670852766796380492141591647820235280258479590321211809950932227663837155357203210368287360556517219699141678162077027077603542458560919519533372505
